In [102]:
import pandas as pd

##### Entendiendo naturaleza de groupby

In [103]:
data = {
    "category": ["A", "B","A","A","B","C","C","C"],
    "values" : [10, 20, 12, 30, 40, 50, 60, 70],
    "quantity" : [1, 2, 3, 4, 5, 6, 7, 8],
}

In [104]:
df_cat = pd.DataFrame(data)

In [105]:
df_cat

  category  values  quantity
0        A      10         1
1        B      20         2
2        A      12         3
3        A      30         4
4        B      40         5
5        C      50         6
6        C      60         7
7        C      70         8

In [150]:
# valores maximos en los datos de category(A,B,C)
df_cat.groupby('category')['values'].max()

category
A    30
B    40
C    70
Name: values, dtype: int64

In [154]:
#  valores medios en los datos categoricos(A,B,C)
df_cat.groupby('category')['values'].mean()

category
A    17.333333
B    30.000000
C    60.000000
Name: values, dtype: float64

In [155]:
df_cat.groupby('category')['values'].median()

category
A    12.0
B    30.0
C    60.0
Name: values, dtype: float64

In [107]:
# valores minimos en los datos de category(A,B,C)
df_cat.groupby("category")["values"].min()

category
A    10
B    20
C    50
Name: values, dtype: int64

In [109]:
# Cantida de valores que cada categoria agrupa( A,B,C)
df_cat.groupby('category')['values'].count()

category
A    3
B    2
C    3
Name: values, dtype: int64

In [110]:
data_2 = {
            'Name': ['Rommel', 'Manuel', 'Rommel', 'Cristiano','Messi', 'Manuel', 'Cristiano', 'Patricio'], 
            'Age': [27, 24, 22, 32,33, 36, 27, 32], 
            'Address': ['Caracas', 'Barcelona', 'Sevilla', 'Medellin','Francia', 'Barcelona', 'Sevilla', 'Alemania'], 
            'Qualification': ['A', 'B', 'C', 'D','E', 'F', 'G', 'B']
}

In [111]:
df_data2 = pd.DataFrame(data_2)

In [112]:
df_data2

        Name  Age    Address Qualification
0     Rommel   27    Caracas             A
1     Manuel   24  Barcelona             B
2     Rommel   22    Sevilla             C
3  Cristiano   32   Medellin             D
4      Messi   33    Francia             E
5     Manuel   36  Barcelona             F
6  Cristiano   27    Sevilla             G
7   Patricio   32   Alemania             B

In [113]:
df_data2['Name'].describe()

count          8
unique         5
top       Rommel
freq           2
Name: Name, dtype: object

In [160]:
df_data2.groupby(['Name', 'Age'])['Address'].count()

Name       Age
Cristiano  27     1
           32     1
Manuel     24     1
           36     1
Messi      33     1
Patricio   32     1
Rommel     22     1
           27     1
Name: Address, dtype: int64

In [165]:
#Agrupa lo valores de las categorias que coinciden en el mismo indice de la lista 
df_data2.groupby(['Name']).groups

{'Cristiano': [3, 6], 'Manuel': [1, 5], 'Messi': [4], 'Patricio': [7], 'Rommel': [0, 2]}

In [126]:
#Agrupa los valores de las categorias que coinciden en el mismo indice de la lista
df_data2.groupby(['Name', 'Age']).groups

{('Cristiano', 27): [6], ('Cristiano', 32): [3], ('Manuel', 24): [1], ('Manuel', 36): [5], ('Messi', 33): [4], ('Patricio', 32): [7], ('Rommel', 22): [2], ('Rommel', 27): [0]}

##### Creacion de nueva valiabre para usar solo 2 categorias

In [117]:
df_d = df_data2[['Name', 'Age']]

In [118]:
df_d

        Name  Age
0     Rommel   27
1     Manuel   24
2     Rommel   22
3  Cristiano   32
4      Messi   33
5     Manuel   36
6  Cristiano   27
7   Patricio   32

In [163]:
# sumamos los valores categoricos de Name con la edad
df_d.groupby(['Name']).sum()

           Age
Name
Cristiano   59
Manuel      60
Messi       33
Patricio    32
Rommel      49

In [161]:
#El mismo caso anterior pero usando sort para ordenar los valores por defecto
df_d.groupby(['Name'], sort = False).sum()

           Age
Name
Rommel      49
Manuel      60
Cristiano   59
Messi       33
Patricio    32